print (2 + 3)
print ("Hello")
print (2, 5, 6, 7, "Artsiom", "Grand", True)


if 1 > 2:
    print ("Hello!") #True = Hello, Fulse = ничего!

'''
    блочный комментарий, он игнорирует как обычный комментарий
    и его можно прописывать в несколько строк
'''
# это обычный комментарий и он полностью игнорируется

name1 = input ("Введите приветственное слово: ")
name2 = input ("Введите Ваше имя: ")
print(name1, name2)

'''
    Для указания, что число представляет двоичную систему, 
    перед числом ставится префикс 0b:
'''
#пример:
a = 0b11
b = 0b1011
c = 0b100001
print(a)    # 3 в десятичной системе
print(b)    # 11 в десятичной системе
print(c)    # 33 в десятичной системе


'''
    Для указания, что число представляет восьмеричную систему, 
    перед числом ставится префикс 0o:
'''
#пример:
a = 0o7
b = 0o11
c = 0o17
print(a)    # 7 в десятичной системе
print(b)    # 9 в десятичной системе
print(c)    # 15 в десятичной системе

'''
    Для указания, что число представляет шестнадцатеричную систему, 
    перед числом ставится префикс 0x:
'''
#пример:
a = 0x0A
b = 0xFF
c = 0xA1
print(a)    # 10 в десятичной системе
print(b)    # 255 в десятичной системе
print(c)    # 161 в десятичной системе