# print("Результат: ", 7, 15, sep="", end="!\n") #значения указаны на две строки
# print("Second \" Line") #конфликтов нет, так как двойная ковычка с указанным элементом(слэшем)
# print("Second \" \t \\ l\ni\nn\ne") #каждый элемент \n все выводит с новой строки
# print("Результат:", 5 * 5, 5 / 2, 5 ** 3)
# print("Результат:", min(1, 2, 3, 4, 5, 6, 7, 8, 9, 0))
# print("Результат:", max(1, 2, 3, 4, 5, 6, 7, 8, 9, 0))
# print("Результат:", abs(-1235)) #выводит число в противоположном значении (1235)
# print("Результат:", pow(5, 3)) #функция возводит в степень
# print("Результат:", round(5 / 3)) #округляет числа к большему значению 
input ()