print (1, end= "")
print (2, end= "")
print (3, end= "")
print (4, end= "")
print (5)

name = input ("Твое имя?")
print ("Ты красавчик", name)


'''
    ython поддерживает все распространенные 
    арифметические операции:
'''
#примеры:
print(6 + 2)  # 8
print(6 - 2)  # 4
print(6 * 2)  # 12
print(6 / 2)  # 3.0
print(7 / 2)  # 3.5
print(7 // 2)  # 3
print(6 ** 2)  # Возводим число 6 в степень 2. Результат - 36
print(7 % 2)  # Получение остатка от деления числа 7 на 2. Результат - 1


'''
    При последовательном использовании нескольких арифметических 
    операций их выполнение производится в соответствии с их приоритетом.
    В начале выполняются операции с большим приоритетом. Приоритеты операций 
    в порядке убывания приведены в следующей таблице
    
    Операции    Направление

    **          Cправо налево

    * / // %    Слева направо

    + -         Слева направо

    Следует отметить, что в арифметических операциях могут принимать 
    участие как целые, так и дробные числа. Если в одной операции участвует 
    целое число (int) и число с плавающей точкой (float), то целое число 
    приводится к типу float.
'''
#пример
number = 3 + 4 * 5**2 + 7
print(number)  # 110

