'''
    Все операции сравнения принимают два операнда 
    и возвращают логическое значение, которое 
    в Python представляет тип bool. Существует 
    только два логических значения - True (выражение истинно) 
    и False (выражение ложно).

    Python поддерживает следующие операции сравнения:
    == Возвращает True, если оба операнда равны. Иначе возвращает False.
    != Возвращает True, если оба операнда НЕ равны. Иначе возвращает False.
    > (больше чем) Возвращает True, если первый операнд больше второго.
    < (меньше чем) Возвращает True, если первый операнд меньше второго.
    >= (больше или равно) Возвращает True, если первый операнд больше или равен второму.
    <= (меньше или равно) Возвращает True, если первый операнд меньше или равен второму.
'''

a, b = 5, 6
result = 5 == 6  # сохраняем результат операции в переменную
print(result)  # False - 5 не равно 6
print(a != b, a > b, a < b) #значение не равно, первое больше второго, первое меньше второго

bool1 = True
bool2 = False
print(bool1 == bool2)  # False - bool1 не равно bool2

message = "hello world!"
hello = "hello"
print(hello in message)  # True - подстрока hello есть в строке "hello world!"
 
gold = "gold"
print(gold in message)  # False - подстроки "gold" нет в строке "hello world!"